app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends"
---
  def index
    @friends = Friend.all

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friend.build(friend_params)

    respond_to do |format|
      if @friend.save

DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 3]]
---
  def destroy
    @friend.destroy

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."id" = ? LIMIT ?  [["user_id", 3], ["id", 7], ["LIMIT", 1]]
---
  def correct_user
    @friend = current_user.friends.find_by(id: params[:id])

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_friend
      @friend = Friend.find(params[:id])